 'use strict'
//Числа----------------------------------

//У строки есть свойство .length, содержащее длину.
//метод toUpperCase(), который возвращает строку в верхнем регистре.

//Функция parseInt и ее аналог parseFloat преобразуют строку символ за символом, пока это возможно. alert( parseInt('12px') ); // 12
//Функция parseInt читает из строки целое число.  
//        parseFloat – дробное.
//функция isNaN  преобразует строку в число аналогично +, а затем вернёт true, если это NaN, то есть если преобразование не удалось.

//Округление
//.toFixed(n). Он округляет число до (n) знаков после запятой.

//Math.floor //Округляет вниз

//Math.ceil //Округляет вверх

//Math.round //Округляет до ближайшего целого

//Math.random() Возвращает псевдослучайное число

//Строки ---------------------------------

//Строки могут содержать специальные символы. Самый часто используемый из таких символов – это «перевод строки». обозначается как \n .
//alert( 'Привет\nМир' ); // выведет "Мир" на новой строке













