// var i = 3;

// while (i) {
//   alert( i-- );
// }
// выведет 3, затем уменьшит i до 2
// выведет 2, затем уменьшит i до 1
// выведет 1, затем уменьшит i до 0
// все, проверка while(i) не даст выполняться циклу дальше.
// i-- (постфиксное) - вернёт старое значение.
// ---------------------------------

// Какие значения i выведет цикл while?
// var i = 0;
// while (++i < 5) alert(i); //1,2,3,4

// var i = 0;
// while (i++ < 5) console.log( i ); //1,2,3,4,5
//-----------------------------------

// Какие значения i выведет цикл for?Какие значения i выведет цикл for?
// for (var i = 0; i < 5; i++) {

//   console.log(i); //5
// }

// for (var i = 0; i < 5; ++i) {

//   console.log(i); //0,1,2,3,4
// }
//------------------------------------

//При помощи цикла for выведите чётные числа от 2 до 10.
// for (var i = 0; i < 10; i++) {
//   if (i % 2 == 0) {
//     console.log(i);
//   }
// }
//-------------------------------------

//Замените for на while.
// var i = 0;
// while (i < 3) { 
//     alert('Номер' + i + '!');
//     i++;
// }
//-------------------------------------

//Повторять цикл, пока ввод неверен.

// var num;

// do {
//   num = prompt('Введите число > 100', 0);
// } while (num <= 100 && num != null);
//--------------------------------------


// Напишите "if", аналогичный "switch"

// var browser = prompt('Какой у Вас браузер?', '');

// if (browser === 'IE') {
//   alert('О да, ты молодец!');

// } else if (browser === 'chrome') {
//   alert('Отлично!');

// } else if (browser === 'firefox') {
//   alert('То-же норм!');

// } else {
//   alert('Вероятно у тебя TOR :)');
// }
//--------------------------------------

// Переписать if'ы в switch

var a = +prompt('a?', '');

switch(a) {
  case 0: {
    alert(0)
  } break;

  case 1: {
    alert(1);
  } break;
  case 2:
  case 3: {
    alert('2,3')
  } break;
}















